"""RAG prompt messages in Arabic."""

from string import Template

#### System ####
system_prompt = Template(
    (
        "أنت مساعد لإنتاج استجابة للمستخدم.\n"
        "سيتم تزويدك بمجموعة من الوثائق المرتبطة باستفسار المستخدم. "
        "يجب أن تولّد استجابة بناءً على الوثائق المقدمة. "
        "تجاهل الوثائق غير المتعلقة باستفسار المستخدم.\n"
        "يجب أن تكون الاستجابة باللغة نفسها التي يستخدمها المستخدم في استفساره.\n"
        "يمكنك الاعتذار للمستخدم إذا لم تتمكن من توليد استجابة. "
        "كن مهذبًا ومحترمًا عند التحدث مع المستخدم. "
        "كن دقيقًا وموجزًا في استجابتك وتجنب المعلومات غير الضرورية."
    )
)

#### Document ####
document_prompt = Template(("## الوثيقة رقم: $doc_num\n" "### المحتوى: $chunk_text"))

#### Footer ####
footer_prompt = Template(
    ("بناءً فقط على الوثائق أعلاه، يرجى توليد إجابة للمستخدم.\n" "## الإجابة:")
)
